app/views/orders/index.html.haml

SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1 AND (`orders`.`created_at` BETWEEN '2017-12-17 00:00:00' AND '2018-01-16 23:59:59') ORDER BY `orders`.`created_at` DESC
---
        .order__main__inner__under__leftbox
          - user_order.orderdetails.each do |order_detail|
            .underbox
              .underbox__image