app/controllers/admins_controller.rb

SELECT  `orders`.* FROM `orders` ORDER BY `orders`.`created_at` DESC LIMIT 10
SELECT `stocks`.* FROM `stocks`
---
  def index
    # 注文履歴最新10件
    @recentorders = Order.order(created_at: :desc).limit(10)
    # 在庫数５未満の商品一覧
    @limitedstocks = []
    @stocks = Stock.all