app/controllers/orders_controller.rb

  def index
    # 個別ユーザ：履歴画面
    # アソシエーションを組んでいる前提

    # オーダ情報取得
    # 期間指定があるか？ない場合は、過去30日の注文を表示する
    if params[:period].nil? || params[:period] == "30"
      @range = Date.current.ago(30.days).beginning_of_day..Date.current.end_of_day
    elsif params[:period] == "6"
      @range = Date.current.ago(6.months).beginning_of_day..Date.current.end_of_day
    else
      @range = DateTime.new(params[:period].to_i,1,1).beginning_of_year..DateTime.new(params[:period].to_i,12,31).end_of_year
    end
    @user_orders = current_user.orders.where(created_at: @range).order(created_at: :desc)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1 AND (`orders`.`created_at` BETWEEN '2017-12-17 00:00:00' AND '2018-01-16 23:59:59') ORDER BY `orders`.`created_at` DESC

    end
    @carts.each do |cart|
      @totalitems += cart.quantity
      @totalitemyen += cart.quantity * Stock.find(cart.stock_id).sell_price
---
SELECT  `stocks`.* FROM `stocks` WHERE `stocks`.`id` = 1 LIMIT 1

  def create
    # 購入完了画面
    # カートテーブルから、そのユーザのレコードのうち、ショッピングカートにあるもの
    # (= buylater_flgがfalseのもの）を持ってくる
    @currentorder = gets_cart_items

    # order_idを確定するために、Orderテーブルにレコードを作成する
    # 現状わかっている、ユーザIDのみを格納する
    @order = Order.create(user_id: current_user.id)

    # 0クリア
    total = 0
    total_shippingcost = 0

    # カートにあるそのユーザのレコード分、Orderdetailsテーブルにレコードを作成する。
    @currentorder.each do |currentorder|
      # インスタンス作成
      @ordermaking = Orderdetail.new

      # order_idカラムに、先ほど作成した@orderのidを格納
      @ordermaking.order_id = @order.id

      # currentorder（そのユーザのカートに入っているもの）の、stock_idとquantityを書き込む
      @ordermaking.stock_id = currentorder.stock_id
      @ordermaking.quantity = currentorder.quantity

      # そのstock_idを持つ商品をStockテーブルから参照し、インスタンス変数にしまう
      @stock = Stock.find(currentorder.stock_id)
---
INSERT INTO `orders` (`user_id`, `created_at`, `updated_at`) VALUES (1, '2018-01-16 19:43:08', '2018-01-16 19:43:08')
SELECT `orderdetails`.* FROM `orderdetails` WHERE `orderdetails`.`order_id` = 1
SELECT  `stocks`.* FROM `stocks` WHERE `stocks`.`id` = 1 LIMIT 1

      total_shippingcost += @ordermaking.total_shippingcost

      # 全カラム値を格納したので、保存する
      @ordermaking.save

      # Stockテーブルから、その商品の在庫数を注文数量分減らして更新
      @stock.current_stock -= @ordermaking.quantity
      @stock.update(current_stock: @stock.current_stock)
---
UPDATE `orders` SET `payments` = 'Creditcard4242', `status` = 'Shipping(preparation)' WHERE `orders`.`id` = 1
UPDATE `stocks` SET `current_stock` = 99, `updated_at` = '2018-01-16 19:43:08' WHERE `stocks`.`id` = 1

      @orderstocknames << Stock.find(orderview.stock_id)
    end
    @user = current_user
    @deliverydate = Order.find(@order.id).created_at.since(2.days)
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1